Autodesk.Revit.DB.BarTypeDiameterOptions.BarNominalDiameter
Represents the bar nominal diameter of the RebarBarType.
Since:
2018.1

Autodesk.Revit.DB.BarTypeDiameterOptions.BarModelDiameter
Represents the bar model diameter of the RebarBarType.
Since:
2018.1

Autodesk.Revit.DB.BarTypeDiameterOptions.#ctor(Autodesk.Revit.DB.Structure.RebarBarType)
Constructs a new BarTypeDiameterOptions copying the diameter information from the bar type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018.1